# ExtrusionDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..ExtrusionDirection Property
IFCExtrusionCreationData Class See Also
---
The extrusion direction to generate an extrusion.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ ExtrusionDirection { get; set; }
```

Visual Basic
---
```text
Public Property ExtrusionDirection As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ ExtrusionDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace